"""
数值运算
描述
获得用户输入的一个字符串，格式如下：‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬

M OP N‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬

其中，M和N是任何数字，OP代表一种操作，表示为如下四种：+, -, *, /（加减乘除）‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬

根据OP，输出M OP N的运算结果，统一保存小数点后2位。‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬

注意：M和OP、OP和N之间可以存在多个空格，不考虑输入错误情况。
"""
# 思路1：题目情况特殊，没有输入错误情况，M OP N一定是一条四则运算的字符串
# 因此直接用eval语句即可执行
s = input()
print("{:.2f}".format(eval(s)))

# 思路2：先检查OP的运算符，根据运算符分割出M,N两个实数，再进行运算操作
tempstr=input()
if '+' in tempstr:
    M = float(tempstr.split("+")[0])
    N = float(tempstr.split("+")[1])
    print("{:.2f}".format(M+N))
elif '*' in tempstr:
    M = float(tempstr.split("*")[0])
    N = float(tempstr.split("*")[1])
    print("{:.2f}".format(M*N))
elif '-' in tempstr:
    M = eval(tempstr.split("-")[0])
    N = float(tempstr.split("-")[1])
    print("{:.2f}".format(M-N))
elif '/' in tempstr:
    M = float(tempstr.split("/")[0])
    N = float(tempstr.split("/")[1])
    print("{:.2f}".format(M/N))