"""
数字形式转换 I
描述
获得用户输入的一个正整数输入，输出该数字对应的中文字符表示。‪‬‪‬‪‬‪‬‪‬‮‬‪‬‫‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‪‬‪‬‪‬‪‬‪‬‪‬‮‬‪‬‭‬‪‬‪‬‪‬‪‬‪‬‮‬‫‬‮‬‪‬‪‬‪‬‪‬‪‬‮‬‭‬‪‬

0到9对应的中文字符分别是：零一二三四五六七八九
"""
#思路1：用字符串或者列表创建索引到值的映射
#答案
template = "零一二三四五六七八九"

s = input()
for c in s:
    print(template[eval(c)], end="")
#思路2: 用字典创建建到值的映射
numstr = input()
numDict = {'1':"一",
    '2':"二",
    '3':"三",
    '4':"四",
    '5':"五",
    '6':"六",
    '7':"七",
    '8':"八",
    '9':"九",
    '0':"零",
}
nullstr=''
for i in numstr:
    nullstr=nullstr+numDict.get(i)

print(nullstr)